# Introduction to Pandas!!!

# 2877. Create a DataFrame from List

In [45]:
import pandas as pd
student_data=[
  [1, 15],
  [2, 11],
  [3, 11],
  [4, 20]
]
pd.DataFrame(student_data, columns=['student_id','age'])

   student_id  age
0           1   15
1           2   11
2           3   11
3           4   20

# 2878. Get the Size of DataFrame

In [47]:
import pandas as pd

data = {
    'player_id': [846, 749, 155, 583, 388, 883, 355, 247, 761, 642],
    'name': ['Mason', 'Riley', 'Bob', 'Isabella', 'Zachary', 'Ava', 'Violet', 'Thomas', 'Jack', 'Charlie'],
    'age': [21, 30, 28, 32, 24, 23, 18, 27, 33, 36],
    'position': ['Forward', 'Winger', 'Striker', 'Goalkeeper', 'Midfielder', 'Defender', 'Striker', 'Striker', 'Midfielder', 'Center-back'],
    'team': ['RealMadrid', 'Barcelona', 'ManchesterUnited', 'Liverpool', 'BayernMunich', 'Chelsea', 'Juventus', 'ParisSaint-Germain', 'ManchesterCity', 'Arsenal']
}

players = pd.DataFrame(data)
players

   player_id      name  age     position                team
0        846     Mason   21      Forward          RealMadrid
1        749     Riley   30       Winger           Barcelona
2        155       Bob   28      Striker    ManchesterUnited
3        583  Isabella   32   Goalkeeper           Liverpool
4        388   Zachary   24   Midfielder        BayernMunich
5        883       Ava   23     Defender             Chelsea
6        355    Violet   18      Striker            Juventus
7        247    Thomas   27      Striker  ParisSaint-Germain
8        761      Jack   33   Midfielder      ManchesterCity
9        642   Charlie   36  Center-back             Arsenal

In [48]:
# df_size=list(players.shape)
df_size=[players.shape[0],players.shape[1]]

print(df_size)

[10, 5]

# 2878. Display the First Three Rows

In [49]:
import pandas as pd

data = {
    'employee_id': [3, 90, 9, 60, 49, 43],
    'name': ['Bob', 'Alice', 'Tatiana', 'Annabelle', 'Jonathan', 'Khaled'],
    'department': ['Operations', 'Sales', 'Engineering', 'InformationTechnology', 'HumanResources', 'Administration'],
    'salary': [48675, 11096, 33805, 37678, 23793, 40454]
}

employees = pd.DataFrame(data)
# print(employees)
# print("**************")
print(employees.head(3))

   employee_id     name   department  salary
0            3      Bob   Operations   48675
1           90    Alice        Sales   11096
2            9  Tatiana  Engineering   33805

# 2880. Select Data

In [50]:
import pandas as pd

data = {
    'student_id': [101, 53, 128, 3],
    'name': ['Ulysses', 'William', 'Henry', 'Henry'],
    'age': [13, 10, 6, 11]
}

students = pd.DataFrame(data)
select_data = students[students['student_id'] == 101]
print(select_data[['name','age']])

      name  age
0  Ulysses   13

# 2881. Create a New Column

In [52]:
import pandas as pd

data = {
    'name': ['Piper', 'Grace', 'Georgia', 'Willow', 'Finn', 'Thomas'],
    'salary': [4548, 28150, 1103, 6593, 74576, 24433]
}

employees = pd.DataFrame(data)

In [53]:
# Add the new column 
employees["bonus"] = employees["salary"]*2
employees

      name  salary   bonus
0    Piper    4548    9096
1    Grace   28150   56300
2  Georgia    1103    2206
3   Willow    6593   13186
4     Finn   74576  149152
5   Thomas   24433   48866

# 2882. Drop Duplicate Row

In [54]:
import pandas as pd

data = {
    'customer_id': [1, 2, 3, 4, 5, 6],
    'name': ['Ella', 'David', 'Zachary', 'Alice', 'Finn', 'Violet'],
    'email': ['emily@example.com', 'michael@example.com', 'sarah@example.com', 'john@example.com', 'john@example.com', 'alice@example.com']
}

customers = pd.DataFrame(data)

In [55]:
print(customers.drop_duplicates(subset=["email"]))

   customer_id     name                email
0            1     Ella    emily@example.com
1            2    David  michael@example.com
2            3  Zachary    sarah@example.com
3            4    Alice     john@example.com
5            6   Violet    alice@example.com

# 2883. Drop Missing Data

In [56]:
data = {'student_id': [32, 217, 779, 849],
        'name': ['Piper', None, 'Georgia', 'Willow'],
        'age': [5, 19, 20, 14]}

students = pd.DataFrame(data)
students

   student_id     name  age
0          32    Piper    5
1         217     None   19
2         779  Georgia   20
3         849   Willow   14

In [57]:
students.dropna(subset=['name'], inplace=True)
print(students)

   student_id     name  age
0          32    Piper    5
2         779  Georgia   20
3         849   Willow   14

# 2884. Modify Columns

In [2]:
import pandas as pd

data = {
    'name': ['Piper', 'Grace', 'Georgia', 'Willow', 'Finn', 'Thomas'],
    'salary': [4548, 28150, 1103, 6593, 74576, 24433]
}

employees = pd.DataFrame(data)

In [3]:
# Add the new column 
employees["salary"] = employees["salary"]*2
employees

      name  salary
0    Piper    9096
1    Grace   56300
2  Georgia    2206
3   Willow   13186
4     Finn  149152
5   Thomas   48866

# 2885. Rename Columns

In [5]:
import pandas as pd

data = {
    'id': [1, 2, 3, 4, 5],
    'first': ['Mason', 'Ava', 'Taylor', 'Georgia', 'Thomas'],
    'last': ['King', 'Wright', 'Hall', 'Thompson', 'Moore'],
    'age': [6, 7, 16, 18, 10]
}

students = pd.DataFrame(data)
students

   id    first      last  age
0   1    Mason      King    6
1   2      Ava    Wright    7
2   3   Taylor      Hall   16
3   4  Georgia  Thompson   18
4   5   Thomas     Moore   10

In [6]:
students = students.rename(columns={'id': 'student_id', 'first': 'first_name',  'last': 'last_name', 'age': 'age_in_years'})
students

   student_id first_name last_name  age_in_years
0           1      Mason      King             6
1           2        Ava    Wright             7
2           3     Taylor      Hall            16
3           4    Georgia  Thompson            18
4           5     Thomas     Moore            10

# 2886. Change Data Type

In [9]:
import pandas as pd

# Create DataFrame
data = {
    'student_id': [1, 2],
    'name': ['Ava', 'Kate'],
    'age': [6, 15],
    'grade': [73.0, 87.0]
}

students = pd.DataFrame(data)
students

   student_id  name  age  grade
0           1   Ava    6   73.0
1           2  Kate   15   87.0

In [10]:
students = students.astype({'grade': int})
students

   student_id  name  age  grade
0           1   Ava    6     73
1           2  Kate   15     87

# 2887. Fill Missing Data

In [18]:
import pandas as pd

data = {
    'name': ['Wristwatch', 'WirelessEarbuds', 'GolfClubs', 'Printer'],
    'quantity': [None, None, 779, 849],
    'price': [135, 821, 9319, 3051]
}

products = pd.DataFrame(data)
products

              name  quantity  price
0       Wristwatch       NaN    135
1  WirelessEarbuds       NaN    821
2        GolfClubs     779.0   9319
3          Printer     849.0   3051

In [19]:
products['quantity'] = products['quantity'].fillna(0)
products

              name  quantity  price
0       Wristwatch       0.0    135
1  WirelessEarbuds       0.0    821
2        GolfClubs     779.0   9319
3          Printer     849.0   3051

# 2887. Reshape Data: Concatenate

In [1]:
import pandas as pd

# Create DataFrame df1
data1 = {
    'student_id': [1, 2, 3, 4],
    'name': ['Mason', 'Ava', 'Taylor', 'Georgia'],
    'age': [8, 6, 15, 17]
}

df1 = pd.DataFrame(data1)

# Create DataFrame df2
data2 = {
    'student_id': [5, 6],
    'name': ['Leo', 'Alex'],
    'age': [7, 7]
}

df2 = pd.DataFrame(data2)

In [4]:
frames = [df1, df2]

result = pd.concat(frames)
result

   student_id     name  age
0           1    Mason    8
1           2      Ava    6
2           3   Taylor   15
3           4  Georgia   17
0           5      Leo    7
1           6     Alex    7

# 2889. Reshape Data: Pivot

In [5]:
import pandas as pd

# Create DataFrame
data = {
    'city': ['Jacksonville', 'Jacksonville', 'Jacksonville', 'Jacksonville', 'Jacksonville', 
             'ElPaso', 'ElPaso', 'ElPaso', 'ElPaso', 'ElPaso'],
    'month': ['January', 'February', 'March', 'April', 'May', 
              'January', 'February', 'March', 'April', 'May'],
    'temperature': [13, 23, 38, 5, 34, 20, 6, 26, 2, 43]
}

weather = pd.DataFrame(data)

In [13]:
#table = pd.pivot_table(weather, values='temperature', index=['month'],columns=['city'], aggfunc="sum")# index = rows
#print(table)
print(weather.pivot( values='temperature', index='month',columns='city'))

city      ElPaso  Jacksonville
month
April          2             5
February       6            23
January       20            13
March         26            38
May           43            34

# 2890. Reshape Data: Melt

In [16]:
import pandas as pd

# Create DataFrame
data = {
    'product': ['Umbrella', 'SleepingBag'],
    'quarter_1': [417, 800],
    'quarter_2': [224, 936],
    'quarter_3': [379, 93],
    'quarter_4': [611, 875]
}

report = pd.DataFrame(data)

In [25]:
print(pd.melt(report, id_vars=['product'], var_name='quarter',value_name='sales'))

       product    quarter  sales
0     Umbrella  quarter_1    417
1  SleepingBag  quarter_1    800
2     Umbrella  quarter_2    224
3  SleepingBag  quarter_2    936
4     Umbrella  quarter_3    379
5  SleepingBag  quarter_3     93
6     Umbrella  quarter_4    611
7  SleepingBag  quarter_4    875

# 2890. Method Chaining

In [26]:
import pandas as pd

# Create DataFrame
data = {
    'name': ['Tatiana', 'Khaled', 'Alex', 'Jonathan', 'Stefan', 'Tommy'],
    'species': ['Snake', 'Giraffe', 'Leopard', 'Monkey', 'Bear', 'Panda'],
    'age': [98, 50, 6, 45, 100, 26],
    'weight': [464, 41, 328, 463, 50, 349]
}

animals = pd.DataFrame(data)

In [32]:
select_animals = animals[animals['weight']>100]
print(select_animals.sort_values(by='weight', ascending=False)[['name']])

       name
0   Tatiana
3  Jonathan
5     Tommy
2      Alex